app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees"
---
  def index
    @employees = Employee.all

INSERT INTO "employees" ("employee_id", "first_name", "last_name", "email", "phone_numbers", "doj", "salary", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params)

    if @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_employee
      @employee = Employee.find(params[:id])